PART_OF_SPEECH = {"NOUN": "имя существительное",
                       "ADJF": "имя прилагательное (полное)",
                       "ADJS": "имя прилагательное (краткое)",
                       "COMP": "компаратив",
                       "VERB": "глагол (личная форма)",
                       "INFN": "глагол (инфинитив)",
                       "PRTF": "причастие (полное)",
                       "PRTS": "причастие (краткое)",
                       "GRND": "деепричастие",
                       "NUMR": "числительное",
                       "ADVB": "наречие",
                  "NPRO": "местоимение-существительное",
                  "PRED": "предикатив",
                  "PREP": "предлог",
                  "CONJ": "союз",
                  "PRCL": "частица",
                  "INTJ": "междометие"}

TENSE = {"past": "прошедшее",
              "pres": "настоящее",
              "futr": "будущее"}

PERSON = {"1per": "первое",
               "2per": "второе",
               "3per": "третье"}

ASPECT = {"perf": "завершённый",
               "impv": "незавершённый"}

NUMBER = {"sing": "единственное",
               "plur": "множественное",
               "Pltm": "множественное",
               "Sgtm": "единственное"}

GENDER = {"masc": "мужской",
               "femn": "женский",
               "neut": "средний",
               "Ms-f": "общий"}

CASE = {'nomn': 'именительный',
             'gent': 'родительный',
             'datv': 'дательный',
             'accs': 'винительный',
             'ablt': 'творительный',
             'loct': 'предложный'}

ANIMACY = {'inan': 'неодушевлённый',
                'anim': 'одушевлённый'}
